Tekla Open API Reference for Tekla Structures 2025
Grid Properties
The Grid type exposes the following members.
Properties
Name | Description
Color
 Gets or sets the color of the grid.
CoordinateX
 The coordinates for the X-axis.
CoordinateY
 The coordinates for the Y-axis.
CoordinateZ
 The coordinates for the Z-axis.
ExtensionForMagneticArea |  Obsolete.
 The extension for the magnetic area.
ExtensionLeftX
 The extension to the left X-axis.
ExtensionLeftY
 The extension to the left Y-axis.
ExtensionLeftZ
 The extension to the left Z-axis.
ExtensionRightX
 The extension to the right X-axis.
ExtensionRightY
 The extension to the right Y-axis.
ExtensionRightZ
 The extension to the right Z-axis.
FontColor
 Gets or sets font color for the grid labels
 (Inherited from GridBase.)
FontSize
 Gets or sets font size for the grid labels
 (Inherited from GridBase.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsMagnetic
 Gets or sets whether the grid is magnetic or not.
 (Inherited from GridBase.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LabelX
 The labels for the X-axis.
LabelY
 The labels for the Y-axis.
LabelZ
 The labels for the Z-axis.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the grid.
 (Inherited from GridBase.)
Origin
 Gets or sets the origin of the grid
 (Inherited from GridBase.)
Top
See Also
Reference
Grid Class
Tekla.Structures.Model Namespace